{
    "common": {
        "name": "oxxify-fan-control",
        "version": "0.0.4",
        "news": {
            "0.0.4": {
                "en": "Updated ESLint to 9.x.x\nFixed copyright issue from adapter checker\nReplaced deletion of all objects with deletion of missing devices from config only\nAvoided illegal characters from user input for fan id within code\nChanged state subscription to all states below the devices folder\nAdded restart logic of UDP server in case of an error\nAdded adapter terminiation if multiple udp server errors occured\nReplaced cyclic checking of the send quene with a timeout approach instead of interval\nMissing intermediate objects created\nRoles updated according to the read/write definitions\nPolling interval limited in JSON config and code\nioBroker unit in object tree for RTC date & time removed",
                "de": "Aktualisierte ESLint auf 9.x.x\nBehobene Urheberrechtsausgabe vom Adapter Checker\nErsetztes Löschen aller Objekte mit Löschen fehlender Geräte von config nur\nVermeiden Sie illegale Zeichen von Benutzereingabe für Fan-ID innerhalb des Codes\nZustandsabonnement aller Zustände unterhalb des Geräteordners geändert\nNeustartlogik des UDP-Servers bei einem Fehler hinzugefügt\nHinzugefügt Adapter-Terminierung, wenn mehrere udp Server-Fehler auftreten\nErsetzte zyklische Überprüfung der Sendequene mit einem Timeout-Ansatz statt Intervall\nFehlende Zwischenobjekte erstellt\nRoles aktualisiert nach den Definitionen für Schreib-/Lesetexte\nPolling-Intervall begrenzt in JSON config und Code\nioBroker Einheit in Objektbaum für RTC Datum & Zeit entfernt",
                "ru": "Обновленный ESLint до 9.x.x\nИсправленный вопрос авторского права от адаптера\nЗамененное удаление всех объектов с удалением отсутствующих устройств из конфигурации только\nИзбегайте незаконных символов от пользовательского ввода для фан-ид в коде\nИзменение государственной подписки на все состояния ниже папки устройств\nДобавлена логика перезапуска сервера UDP в случае ошибки\nДобавлена терминизация адаптера, если произошли несколько ошибок udp-сервера\nЗамененная циклическая проверка присылочного кена с подходом тайм-аута вместо интервала\nПропущенные промежуточные объекты, созданные\nРоли, обновленные в соответствии с определениями считывания/записи\nИнтервал опроса ограничен в настройке и коде JSON\nioBroker unit in object tree for RTC date & time removed",
                "pt": "ESLint atualizado para 9.x.x\nCorrigido problema de direitos autorais do verificador do adaptador\nEliminação substituída de todos os objetos com exclusão de dispositivos ausentes apenas de configuração\nPersonagens ilegais evitados de entrada de usuário para identificação de fãs dentro do código\nAssinatura de estado alterada para todos os estados abaixo da pasta de dispositivos\nAdicionada lógica de reinício do servidor UDP em caso de um erro\nAdicionado terminiation do adaptador se vários erros do servidor udp ocorrem\nVerificação cíclica substituída da quene de envio com uma aproximação de tempo limite em vez de intervalo\nObjetos intermediários perdidos criados\nFunções atualizadas de acordo com as definições de leitura/escrita\nIntervalo de Polling limitado em JSON config e código\nioBroker unidade em árvore de objeto para RTC data & tempo removido",
                "nl": "Bijgewerkt ESLint naar 9.x.x\nVast copyright probleem van adaptercontrole\nVervangen verwijdering van alle objecten door verwijdering van ontbrekende apparaten van alleen config\nOngeldige tekens vermeden van gebruikersinvoer voor fan-id binnen code\nAangepaste statusabonnement naar alle staten onder de apparaatmap\nToegevoegd herstart logica van UDP-server in geval van een fout\nToegevoegde adapterterminatie als zich meerdere udp-serverfouten hebben voorgedaan\nVervangde cyclische controle van de send quene door een timeout benadering in plaats van interval\nOntbrekende tussenliggende objecten aangemaakt\nTaken bijgewerkt volgens de lees-/schrijfdefinities\nPolling interval beperkt in JSON configuratie en code\nioBroker-eenheid in objectboom voor RTC-datum en -tijd verwijderd",
                "fr": "Mise à jour de ESLint à 9.x.x\nCorrection de la question des droits d'auteur de l'adaptateur checker\nSuppression remplacée de tous les objets avec suppression des périphériques manquants de config seulement\nÉvité les caractères illégaux de l'entrée utilisateur pour l'identifiant du ventilateur dans le code\nAbonnement d'état modifié à tous les états sous le dossier des périphériques\nAjout de la logique de redémarrage du serveur UDP en cas d'erreur\nAjout de la terminaison d'adaptateur si plusieurs erreurs de serveur udp se produisent\nRemplacer la vérification cyclique de la quene d'envoi par une approche de timeout au lieu de l'intervalle\nObjets intermédiaires manquants créés\nRôles mis à jour selon les définitions de lecture/écriture\nIntervalle de sondage limité dans la configuration et le code JSON\nioBroker unité dans l'arborescence de l'objet pour la date et l'heure RTC enlevée",
                "it": "Aggiornato da ESLint a 9.x.x\nRisolto problema di copyright da adattatore checker\nCancellazione sostituita di tutti gli oggetti con cancellazione di dispositivi mancanti dalla configurazione solo\nEvitati caratteri illegali dall'ingresso dell'utente per fan id all'interno del codice\nAbbonamento stato modificato a tutti gli stati sotto la cartella dei dispositivi\nAggiunta la logica di riavvio del server UDP in caso di un errore\nTerminizzazione dell'adattatore aggiunta se si verificano più errori del server udp\nControllo ciclico sostituito della quene di invio con un approccio timeout invece di intervallo\nOggetti intermedi mancanti creati\nRoles aggiornato secondo le definizioni di lettura/scrittura\nIntervallo d'inquinamento limitato nella configurazione e nel codice JSON\nunità ioBroker in albero di oggetto per RTC data e ora rimosso",
                "es": "Actualizado ESLint a 9.x.x\nEdición fija de derechos de autor desde el control de adaptador\nSustitución de la eliminación de todos los objetos con la eliminación de dispositivos perdidos de config solamente\nEvitar caracteres ilegales desde la entrada del usuario para fan id dentro del código\nCambio de suscripción estatal a todos los estados debajo de la carpeta de dispositivos\nAñadido la lógica de reinicio del servidor UDP en caso de error\nSe agregó la terminiación del adaptador si se produjeron múltiples errores del servidor udp\nComprobación cíclica sustituida de la quena envía con un enfoque de timeout en lugar de intervalo\nDesapareciendo objetos intermedios creados\nFunciones actualizadas según las definiciones de lectura/escritura\nIntervalo de votación limitado en JSON config y código\nioBroker unidad en árbol de objeto para la fecha RTC \" tiempo eliminado",
                "pl": "Aktualizacja ESLint do 9.x.x\nStała kwestia praw autorskich z kontrolera adaptera\nZastąpione usunięcie wszystkich obiektów z usunięciem brakujących urządzeń tylko z konfigu\nUnikanie nielegalnych znaków z wejścia użytkownika dla id wentylatora w ramach kodu\nZmieniona subskrypcja państwa do wszystkich stanów poniżej folderu urządzeń\nDodano logikę restartu serwera UDP w przypadku błędu\nDodano zamknięcie adaptera jeśli błędy wielu serwerów udp\nZastąpione cykliczne sprawdzanie quene wysyłania z podejścia timeout zamiast interwału\nBrakujące obiekty pośrednie utworzone\nRole zaktualizowane zgodnie z definicjami odczytu / zapisu\nPrzedział ankietowy ograniczony w konfiguracji JSON i kodzie\nioBroker unit in object tree for RTC date & time usunięty",
                "uk": "Оновлено ESLint до 9.x.x\nВиправлено проблему авторського права з адаптера\nЗаміна видалення всіх об'єктів з видаленням відсутніх пристроїв з налаштування тільки\nУникайте неправомірних символів із введенням користувача для входу вентилятора в код\nЗмінена підписка стану до всіх штатів нижче папки пристроїв\nДодана логіка перезавантаження UDP сервера у разі помилки\nДодано термінініацію адаптера, якщо виникають помилки сервера udp\nЗаміна циклічних перевірок відправки квена з підходом часу замість інтервалу\nЗміщення проміжних об'єктів, створених\nРолі оновлено відповідно до визначення читаного/запису\nПолілінг інтервал обмежений в налаштуваннях JSON і коді\nioBroker unit в об'єктному дереві для дати RTC і часу видалено",
                "zh-cn": "更新到9.x.x\n适配器检查器的固定版权问题\n替换为只删除配置中缺失的设备\n避免用户输入非法字符用于代码内的扇形 ID\n更改设备文件夹下方所有状态的状态订阅\n在出现错误时添加 UDP 服务器的重启逻辑\n如果出现多个 udp 服务器错误, 则添加适配器终止\n以超时方式而不是间隔方式取代对发送队列的循环检查\n缺少中间对象\n根据读/写定义更新的角色\n在 JSON 配置和代码中限制投票间隔\n对象树中的 ioBroker 单元,用于删除 RTC 日期和时间"
            },
            "0.0.3": {
                "en": "- Added states for objects with high byte 0x03 with reading and writing\n- Recreate device objects on adapter restart\n- Simplified methods for writing fan data based on subscribed states\n- Added a first unit test for the parsing of numbers.\n\n<!--\n    Placeholder for the next version (at the beginning of the line):\n    ### **WORK IN PROGRESS**\n-->",
                "de": "- Hinzugefügt Zustände für Objekte mit hohem Byte 0x03 mit Lesen und Schreiben\n- Geräteobjekte auf Adapter neu starten\n- Vereinfachte Methoden zum Schreiben von Fandaten basierend auf abonnierten Zuständen\n- Es wurde ein erster Einzeltest für die Parsierung von Zahlen hinzugefügt.\n\n<!--\nPlatzhalter für die nächste Version (am Anfang der Linie):\n**WORK IN PROGRESS**\n-->",
                "ru": "- Добавленные состояния для объектов с высоким байтом 0x03 с чтением и написанием\n- Восстановление объектов устройства при перезагрузке адаптера\n- Упрощенные методы для написания фан-данных на основе подписанных государств\n- Добавлено первое единичное испытание для выравнивания чисел.\n\n<!--\nМестоположение для следующей версии (в начале линии):\n** В ПРОГРЕССЕ**\n-->",
                "pt": "- estados adicionados para objetos com alto byte 0x03 com leitura e escrita\n- Recriar objetos de dispositivo no reinício do adaptador\n- Métodos simplificados para escrever dados de fãs com base em estados subscritos\n- Adicionado um primeiro teste de unidade para a análise de números.\n\n<!--\nPlaceholder para a próxima versão (no início da linha):\n# # # TRABALHO EM PROGRESSO #\n-->",
                "nl": "- Toegevoegd toestanden voor objecten met hoge byte 0x03 met lezen en schrijven\n- Apparaatobjecten op adapter herstarten\n- Vereenvoudigde methoden voor het schrijven van fangegevens op basis van de ingeschreven staten\n- Een eerste test toegevoegd voor het verwerken van getallen.\n\n<!--\nPlaatshouder voor de volgende versie (aan het begin van de regel):\nWORK IN PROGRESS\n-->",
                "fr": "- Ajout d'états pour les objets avec haut octet 0x03 avec lecture et écriture\n- Recréer les objets du périphérique lors du redémarrage de l'adaptateur\n- Méthodes simplifiées pour l'écriture des données des ventilateurs basées sur les états souscrits\n- Ajout d'un premier test unitaire pour l'analyse des nombres.\n\n<!--\nPlaceholder pour la prochaine version (au début de la ligne):\n### **WORK IN PROGRESS**\n-->",
                "it": "- Aggiunti stati per oggetti con byte 0x03 alto con lettura e scrittura\n- Riattivare gli oggetti del dispositivo sul riavvio dell'adattatore\n- Metodi semplificati per la scrittura dei dati dei fan in base agli stati iscritti\n- Aggiunto un primo test unitario per la parsing dei numeri.\n\n<!--\nSegnaposto per la prossima versione (all'inizio della linea):\n######WORK IN PROGRESS #\n-->",
                "es": "- Estados añadidos para objetos con alto byte 0x03 con lectura y escritura\n- Recrear objetos de dispositivo en el reinicio del adaptador\n- Métodos simplificados para escribir datos de fans basados en estados suscritos\n- Se agregó una primera prueba de unidad para el perfeccionamiento de números.\n\n<!--\nTitular para la próxima versión (al principio de la línea):\n#### **WORK IN PROGRESS**\n-->",
                "pl": "- Dodano stany dla obiektów o wysokim bajcie 0x03 z czytaniem i pisaniem\n- Regeneracja obiektów urządzenia przy ponownym uruchomieniu adaptera\n- Uproszczone metody zapisu danych fanów na podstawie subskrybowanych stanów\n- Dodano pierwszy test jednostkowy na parsowanie liczb.\n\n<!--\nUchwyt do następnej wersji (na początku wiersza):\n** * WORK IN PROGRESS **\n-->",
                "uk": "- Додано стани для об'єктів з високим байтом 0x03 з читанням та письмовим записом\n- Відтворити об'єкти пристроїв на перезавантаженні адаптера\n- Спрощені методи написання даних вентилятора на основі підписаних штатів\n- Додано тест першого блоку для парсингу чисел.\n\n<!--\nМісцевласника для наступної версії (на початку лінії):\n###**\n-->",
                "zh-cn": "- 对有读写功能的高字节0x03的对象添加状态\n- 在适配器重新启动时重建设备对象\n- 简化根据订阅状态编写风扇数据的方法\n- 增加了第一个数字解析单元测试.\n\n<!--\n下一个版本(行首)的占位符 :\n** 工作进展**\n-->"
            },
            "0.0.2": {
                "en": "initial release",
                "de": "erstausstrahlung",
                "ru": "первоначальный выпуск",
                "pt": "lançamento inicial",
                "nl": "eerste release",
                "fr": "libération initiale",
                "it": "rilascio iniziale",
                "es": "liberación inicial",
                "pl": "początkowe zwolnienie",
                "uk": "початковий реліз",
                "zh-cn": "初步释放"
            }
        },
        "titleLang": {
            "en": "Oxxify Fan Control",
            "de": "Oxxify-Lüftersteuerung",
            "ru": "Управление вентилятором Oxxify",
            "pt": "Controle de ventilador Oxxify",
            "nl": "Oxxify-ventilatorbediening",
            "fr": "Contrôle du ventilateur Oxxify",
            "it": "Controllo della ventola Oxxify",
            "es": "Control del ventilador Oxxify",
            "pl": "Sterowanie wentylatorem Oxxify",
            "uk": "Контроль вентиляторів Oxxify",
            "zh-cn": "Oxxify 风扇控制"
        },
        "desc": {
            "en": "Integrate your Oxxify Fans into your Smart Home.",
            "de": "Integrieren Sie Ihre Oxxify-Lüfter in Ihr Smart Home.",
            "ru": "Интегрируйте вентиляторы Oxxify в свой умный дом.",
            "pt": "Integre seus fãs Oxxify em sua casa inteligente.",
            "nl": "Integreer je Oxxify Fans in je Smart Home.",
            "fr": "Intégrez vos ventilateurs Oxxify dans votre maison intelligente.",
            "it": "Integra i tuoi fan Oxxify nella tua casa intelligente.",
            "es": "Integra tus Fans Oxxify en tu Hogar Inteligente.",
            "pl": "Zintegruj swoich fanów Oxxify ze swoim inteligentnym domem.",
            "uk": "Інтегруйте вентилятори Oxxify у свій розумний дім.",
            "zh-cn": "将您的 Oxxify 风扇集成到您的智能家居中。"
        },
        "authors": ["N-b-dy <daten4me@gmx.de>"],
        "keywords": ["oxxify", "fan", "ventilation"],
        "licenseInformation": {
            "type": "free",
            "license": "GPL-3.0-or-later"
        },
        "platform": "Javascript/Node.js",
        "icon": "oxxify-fan-control.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/N-b-dy/ioBroker.oxxify-fan-control/main/admin/oxxify-fan-control.png",
        "readme": "https://github.com/N-b-dy/ioBroker.oxxify-fan-control/blob/main/README.md",
        "loglevel": "info",
        "tier": 3,
        "mode": "daemon",
        "type": "climate-control",
        "compact": true,
        "connectionType": "local",
        "dataSource": "poll",
        "adminUI": {
            "config": "json"
        },
        "dependencies": [
            {
                "js-controller": ">=6.0.11"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=7.4.10"
            }
        ]
    },
    "native": {
        "pollingInterval": 5,
        "ntpServer": "0.de.pool.ntp.org",
        "fans": [
            {
                "name": "fan1",
                "id": "1234567890123456",
                "ipaddr": "192.168.1.1",
                "password": "topsecret"
            }
        ]
    },
    "protectedNative": ["fans.password"],
    "encryptedNative": ["fans.password"],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Device or service connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
